In [26]:
import glob
import numpy as np
from PIL import Image

In [27]:
images=sorted(glob.glob('./Data/모두 합친 이미지/adidas/*.jpg'))

imgArr = []
for image in images:
    imgArr.append(np.array(Image.open(image), dtype=np.int32).reshape(-1).tolist())

In [28]:
len(imgArr)

240

In [29]:
target_adidas = ['adidas' for i in range(240)]

In [30]:
import pandas as pd

df = pd.DataFrame(imgArr)

In [31]:
target = pd.DataFrame(target_adidas)

In [32]:
target.columns = ['target']

In [34]:
df = pd.concat([df,target],axis=1)

In [35]:
df.to_csv('./Data/image_csv/adidas.csv',index=False)

In [38]:
df2 = pd.read_csv('./Data/image_csv/converse+nike.csv')

In [41]:
df2.head()

,0,1,2,3,4,5,6,7,8,9,...,49143,49144,49145,49146,49147,49148,49149,49150,49151,target
0,11,11,11,11,11,11,11,11,11,11,...,11,11,11,11,11,11,11,11,11,converse
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,converse
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,converse
3,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,converse
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,converse

In [48]:
df2.tail()

,0,1,2,3,4,5,6,7,8,9,...,49143,49144,49145,49146,49147,49148,49149,49150,49151,target
475,15,15,15,11,11,11,6,6,6,2,...,10,10,10,10,10,10,7,7,7,nike
476,13,13,13,11,11,11,8,8,8,5,...,2,2,2,2,2,2,2,2,2,nike
477,17,17,17,15,15,15,11,11,11,7,...,7,7,7,7,7,7,7,7,7,nike
478,24,24,24,18,18,18,11,11,11,6,...,5,5,5,6,6,6,6,6,6,nike
479,9,9,9,6,6,6,3,3,3,0,...,0,0,0,0,0,0,0,0,0,nike

In [52]:
np.sum(df2.isnull()).sum()

0

In [42]:
df.head()

,0,1,2,3,4,5,6,7,8,9,...,49143,49144,49145,49146,49147,49148,49149,49150,49151,target
0,4,4,4,3,3,3,2,2,2,1,...,1,1,1,1,1,1,2,2,2,adidas
1,30,29,27,22,21,19,14,13,11,10,...,0,0,0,0,0,0,0,0,0,adidas
2,22,22,22,15,15,15,8,8,8,6,...,4,9,3,3,10,2,3,10,2,adidas
3,15,16,20,23,24,28,7,8,13,13,...,16,11,8,14,9,6,11,6,3,adidas
4,24,20,19,19,15,14,16,12,11,16,...,4,2,3,4,2,3,4,2,3,adidas

In [64]:
df.columns = df2.columns

In [68]:
df = pd.concat([df,df2],ignore_index=True)

In [69]:
df.to_csv('./Data/image_csv/all.csv',index=False)